import { MonthData } from '../types';

export const CALENDAR_DATA: MonthData[] = [
  {
    name: 'वैशाख',
    days: [
      'नयाँ वर्ष', 'योजना', 'योजना', 'योजना', 'शनि', 'आइत', 'निर्माण कार्य', 'निर्माण कार्य', 'निर्माण कार्य', 'निर्माण कार्य', 'निर्माण कार्य', 'शनि', 'आइत', ' भर्ना अवधि', ' भर्ना अवधि', ' भर्ना अवधि', ' भर्ना अवधि', 'बुद्ध जयन्ती', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖'
    ],
    stats: { schoolOpen: 15, teachingDays: 10, saturdays: 4, sundays: 4, holidays: 2, examHolidays: 0, extra: 5, total: 31 }
  },
  {
    name: 'जेठ',
    days: [
      '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', 'स्थानिय विदा', '📖', 'गणतन्त्र दिवस', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत'
    ],
    stats: { schoolOpen: 19, teachingDays: 19, saturdays: 5, sundays: 5, holidays: 2, examHolidays: 0, extra: 0, total: 31 }
  },
  {
    name: 'असार',
    days: [
      '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', 'वि', '📖', '📖','📖','📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖'
    ],
    stats: { schoolOpen: 13, teachingDays: 13, saturdays: 2, sundays: 2, holidays: 15, examHolidays: 0, extra: 0, total: 32 }
  },
  {
    name: 'साउन',
    days: [
      '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', 'प', 'प', 'प', 'प', 'प', 'शनि', 'आइत'
    ],
    stats: { schoolOpen: 20, teachingDays: 15, saturdays: 5, sundays: 5, holidays: 0, examHolidays: 5, extra: 0, total: 30 }
  },
  {
    name: 'भदौ',
    days: [
      'ओल्के', 'परीक्षा', 'परीक्षा', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', 'रक्षा बन्धन', 'शनि', 'आइत', '📖', '📖', '📖', '📖', 'गौरा पर्व', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', 'तीज विदा', 'स्थानिय विदा', '📖'
    ],
    stats: { schoolOpen: 17, teachingDays: 15, saturdays: 4, sundays: 4, holidays: 5, examHolidays: 2, extra: 0, total: 30 }
  },
  {
    name: 'असोज',
    days: [
      '📖', '📖', 'संविधान दिवस', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'घटस्थापना', '📖', '📖', '📖', '📖', '📖', 'फूलपाती'
    ],
    stats: { schoolOpen: 21, teachingDays: 21, saturdays: 3, sundays: 3, holidays: 3, examHolidays: 0, extra: 0, total: 30 }
  },
  {
    name: 'कार्तिक',
    days: [
      'द', 'द', 'द', 'द', 'द', 'द', 'द', 'द', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'ति', 'ति', 'ति', 'ति', 'ति', 'ति', 'स्थानिय बिदा', 'शनि', 'छठ पर्व', '📖'
    ],
    stats: { schoolOpen: 12, teachingDays: 12, saturdays: 2, sundays: 2, holidays: 17, examHolidays: 0, extra: 0, total: 33 }
  },
  {
    name: 'मङ्सिर',
    days: [
      '📖', '📖', '📖', 'पिकनिक १ दिन', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', 'प', 'प', 'प', 'शनि', 'आइत', 'प', 'प', 'प', 'प', '📖', 'शनि', 'वार्षिकोत्सव', 'वार्षिकोत्सव', 'वार्षिकोत्सव'
    ],
    stats: { schoolOpen: 23, teachingDays: 11, saturdays: 4, sundays: 3, holidays: 0, examHolidays: 8, extra: 4, total: 30 }
  },
  {
    name: 'पुस',
    days: [
      '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', 'उधाैली पर्व', 'क्रिसमस', 'शनि', 'आइत', '📖', '📖', 'तमु ल्होसार', '📖', '📖', 'शनि', 'वि.स.स गठन', '📖', '📖', '📖', 'भुवा पर्व', 'स्थानिय पर्व', 'शनि', 'आइत', 'पृथ्वी जयन्ती', '📖', '📖', 'पिता पर्व'
    ],
    stats: { schoolOpen: 13, teachingDays: 13, saturdays: 3, sundays: 3, holidays: 7, examHolidays: 0, extra: 0, total: 26 }
  },
  {
    name: 'माघ',
    days: [
      'माघी पर्व', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖',  'शहिद दिवस', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'सोनम ल्होसार', 'स्थानिय विदा', '📖', '📖', 'सरस्वती पूजा', '📖'
    ],
    stats: { schoolOpen: 18, teachingDays: 18, saturdays: 3, sundays: 3, holidays: 5, examHolidays: 0, extra: 0, total: 29 }
  },
  {
    name: 'फागुन',
    days: [
      'शनि', 'आइत', '📖', '📖', '📖', '📖', 'प्रजातन्त्र दिवस', 'शनि', 'आइत', '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', '📖', '📖', '📖','📖','📖', 'शिव रात्री', 'आहत', 'नारी दिवस', 'ग्याल्पो ल्होसार', '📖', '📖', '📖', 'शनि', 'आइत'
    ],
    stats: { schoolOpen: 17, teachingDays: 17, saturdays: 4, sundays: 4, holidays: 5, examHolidays: 0, extra: 0, total: 30 }
  },
  {
    name: 'चैत',
    days: [
      '📖', '📖', '📖', '📖', '📖', 'शनि', 'आइत', 'फागु पूर्णिमामा ', '📖', '📖', '📖', '📖', 'शनि', 'आइत', 'खखडेरा पर्व', 'प', 'प', 'प', 'प', 'शनि', 'आइत', 'प', 'प', 'प', 'रिजल्ट', 'रिजल्ट', 'शनि', 'आइत', 'तयारी', 'नतिजा प्रकाशन'
    ],
    stats: { schoolOpen: 12, teachingDays: 2, saturdays: 3, sundays: 3, holidays: 0, examHolidays: 8, extra: 2, total: 18 }
  }
];
